#Цикл while
"""
Цикл while отличается от цикла for тем что цикл while код выполняется до тех п ор какой
то условия которое указанное в цикле является истинным
"""
"""Слово while переводится как до тех пор"""
# x = 1
# while x > 1:#Здесь ничего не работает потому здесь ложь
#     print(x)

# x = 2
# while x > 1:#Здесь работает бесконечно потому что здесь правда тоесть x больше одного
#     print(x)

x = 2
# while x > 1:
#     """Сначала идет проверка на условия x больше 1 (Правда) потом отнимаем x = x - 1
#     при повторном проверке x меньше 2 при этом цикл прекрашается (Ложь)
#     """
#     print(x)
#     x = x - 1
#
# while x < 10:
#     print(x)
#     x = x + 1

# while x < 10:
#     print(x)
#     x += 1


# while x < 10:
#     print(x)
#     x += x

#break, continue, pass
some_list = [1,2,3,4,5,6,7,8,9,10]
